spec/fixtures/subscriptions/show-200-manual.xml

<subscription href="https://api.recurly.com/v2/subscriptions/123456789012345678901234567890ab"><uuid>123456789012345678901234567890ab</uuid><account href="https://api.recurly.com/v2/accounts/subscribemock"/><plan href="https://api.recurly.com/v2/plans/basicplan"><plan_code>basicplan</plan_code><name>Basic Plan</name></plan><state>active</state><quantity type="integer">1</quantity><net_terms type="integer">10</net_terms><collection_method>manual</collection_method><po_number>1000</po_number><currency>EUR</currency><unit_amount_in_cents type="integer">1000</unit_amount_in_cents><activated_at type="datetime">2011-05-27T07:00:00Z</activated_at><canceled_at nil="nil"></canceled_at><expires_at nil="nil"></expires_at><current_period_started_at type="datetime">2011-06-27T07:00:00Z</current_period_started_at><current_period_ends_at type="datetime">2010-07-27T07:00:00Z</current_period_ends_at><trial_started_at nil="nil"></trial_started_at><trial_ends_at nil="nil"></trial_ends_at><subscription_add_ons type="array"></subscription_add_ons><a name="cancel" href="https://api.recurly.com/v2/subscriptions/123456789012345678901234567890ab/cancel" method="put"/><a name="terminate" href="https://api.recurly.com/v2/subscriptions/123456789012345678901234567890ab/terminate" method="put"/><a name="notes" href="https://api.recurly.com/v2/subscriptions/123456789012345678901234567890ab/notes" method="put"/></subscription>
